# We gonna make it!

In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [4]:
path = 'https://bit.ly/AirQFile'
air = pd.read_csv(path)

air.head()

   Ozone  Solar.R  Wind  Temp  Month  Day
0   41.0    190.0   7.4    67      5    1
1   36.0    118.0   8.0    72      5    2
2   12.0    149.0  12.6    74      5    3
3   18.0    313.0  11.5    62      5    4
4    NaN      NaN  14.3    56      5    5

In [5]:
# 결측치 확인
air.isnull().sum()

Ozone      37
Solar.R     7
Wind        0
Temp        0
Month       0
Day         0
dtype: int64

In [6]:
# 결측치 채우기 (직전 데이터)
air.fillna(method='ffill', inplace=True)

air.isnull().sum()

Ozone      0
Solar.R    0
Wind       0
Temp       0
Month      0
Day        0
dtype: int64

In [7]:
# 기초 통계량

air.describe()

            Ozone     Solar.R        Wind        Temp       Month         Day
count  153.000000  153.000000  153.000000  153.000000  153.000000  153.000000
mean    39.784314  186.032680    9.957516   77.882353    6.993464   15.803922
std     31.559455   90.698707    3.523001    9.465270    1.416522    8.864520
min      1.000000    7.000000    1.700000   56.000000    5.000000    1.000000
25%     16.000000  112.000000    7.400000   72.000000    6.000000    8.000000
50%     30.000000  203.000000    9.700000   79.000000    7.000000   16.000000
75%     52.000000  259.000000   11.500000   85.000000    8.000000   23.000000
max    168.000000  334.000000   20.700000   97.000000    9.000000   31.000000

In [8]:
# Graduate
path = 'https://bit.ly/GraduateFile'
graduate = pd.read_csv(path)

graduate.head()

   admit  gre   gpa  rank
0      0  380  3.61     3
1      1  660  3.67     3
2      1  800  4.00     1
3      1  640  3.19     4
4      0  520  2.93     4

In [9]:
# 범주값 확인
graduate['rank'].value_counts()

2    151
3    121
4     67
1     61
Name: rank, dtype: int64

In [14]:
# 가변수화 작업
graduate = pd.get_dummies(graduate, columns=['rank'], drop_first=True)
graduate.head()

   admit  gre   gpa  rank_2  rank_3  rank_4
0      0  380  3.61       0       1       0
1      1  660  3.67       0       1       0
2      1  800  4.00       0       0       0
3      1  640  3.19       0       0       1
4      0  520  2.93       0       0       1

In [15]:
# x,y 분리
target = 'admit'
x = graduate.drop(target, axis=1)
y = graduate.loc[:, target]

In [16]:
print(x.shape, y.shape)

(400, 5) (400,)

In [27]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.3, random_state=2022)

In [28]:
x_train.head()

     gre   gpa  rank_2  rank_3  rank_4
387  580  3.36       1       0       0
169  600  3.62       0       1       0
382  540  3.51       1       0       0
280  660  3.94       1       0       0
140  640  3.93       1       0       0

In [29]:
target = 'Ozone'
x = air.drop(target, axis=1)
y = air.loc[:, target]

In [30]:
from sklearn.model_selection import train_test_split
x_train, x_test, y_train, y_test = train_test_split(x, y, test_size=0.3, random_state=2022)

print( x_train.shape, x_test.shape, y_train.shape, y_test.shape )

(107, 5) (46, 5) (107,) (46,)